# db = [
#     {
#         "name": "Открытие зимнего спортивного фестиваля в Москве",
#         "description": "В Москве состоялось торжественное открытие ежегодного зимнего спортивного фестиваля. В программе — соревнования по фигурному катанию, хоккею и лыжным гонкам.",
#         "created_at": "12.01.2026"
#     },
#     {
#         "name": "Новый закон о цифровой безопасности принят",
#         "description": "Парламент принял закон, направленный на усиление защиты персональных данных граждан и повышение требований к кибербезопасности компаний.",
#         "created_at": "03.02.2026"
#     },
#     {
#         "name": "Запуск нового спутника связи",
#         "description": "С космодрома успешно запущен новый спутник связи, который обеспечит улучшенное покрытие интернета в отдалённых регионах.",
#         "created_at": "18.02.2026"
#     },
#     {
#         "name": "Рост цен на нефть на мировом рынке",
#         "description": "Мировые цены на нефть выросли на фоне сокращения добычи и увеличения спроса со стороны стран Азии.",
#         "created_at": "25.02.2026"
#     },
#     {
#         "name": "Открытие международной выставки технологий ",
#         "description": "Стартовала международная выставка инновационных технологий, где представлены разработки в области ИИ, робототехники и энергетики.\n",
#         "created_at": "28.02.2026"
#     }
# ]
# a = input("Введите новость: ")
# for i in db:
#     if a.lower() in i["name"].lower():
#         i["description"].lower()
#         i["created_at"].lower()
#         print(i)




